Revit 2026 API

# RebarConstraintCreate Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarConstraint Create(
	RebarConstrainedHandle handle,
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```vb
Public Shared Function Create (
	handle As RebarConstrainedHandle,
	targetReferences As IList(Of Reference),
	isConstraintToCover As Boolean,
	offsetValue As Double
) As RebarConstraint
```
```cpp
public:
static RebarConstraint^ Create(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```fsharp
static member Create :
        handle : RebarConstrainedHandle *
        targetReferences : IList<Reference> *
        isConstraintToCover : bool *
        offsetValue : float -> RebarConstraint
```

#### Parameters

handle RebarConstrainedHandle

targetReferences IListReference

isConstraintToCover Boolean

offsetValue Double

#### Return Value

RebarConstraint

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace